USE HoYo_Achievement;

INSERT INTO zzz_achievement (achievement_id, class_id, name, description, reward_level, hidden, game_version)
    VALUES
('1001057', '1001', '...无力野人？', '在野火镇拍摄已经掉漆的「无边野火」路牌。', '1', '1', '1.2'),
('1001058', '1001', '无可挑剔', '在「芝托邦」找到牙签仙人掌「盆栽」。', '1', '1', '1.2'),
('1001059', '1001', '您这是正经杂货店吗？', '在深夜的野火镇找到「747」杂货摊位。', '1', '1', '1.2'),
('1001060', '1001', '少女神明的七日箱庭', '通过［调整时段］功能，累计推移28个时段。', '1', '1', '1.2'),
('1001061', '1001', '荒野采风', '在野火镇找到喵吉长官，并集齐全部奖章。', '1', '2', '1.2'),
('1004024', '1004', '霸主座上宾', '凯撒对绳匠的信赖达到4阶。', '1', '2', '1.2'),
('1004025', '1004', '快乐燃友', '柏妮思对绳匠的信赖达到4阶。', '1', '2', '1.2'),
('1004026', '1004', '开车请直视前方', '派派对绳匠的信赖达到4阶。', '1', '2', '1.2'),
('1004027', '1004', '她的星空下', '露西对绳匠的信赖达到4阶。', '1', '2', '1.2'),
('1005007', '1005', '英雄诞生', '完成法厄同纪事「火狱骑行」。', '3', '1', '1.2'),
('1006008', '1006', '曾经阔过！', '完成柏妮思的代理人秘闻「幸运当头」。', '2', '1', '1.2'),
('1008001', '1008', '欢迎光临「芝托邦」', '重建「芝托邦」。', '1', '1', '1.2'),
('1008002', '1008', '隐藏菜单', '经营「芝托邦」并解锁留言簿中的全部菜品。', '1', '2', '1.2'),
('1008003', '1008', '六星好评', '经营「芝托邦」并获得所有顾客的盛赞。', '1', '2', '1.2'),
('1008004', '1008', '芝士就是力量', '完成「芝托邦」的所有待办事项。', '1', '2', '1.2'),
('1009001', '1009', '「心法」炼成', '使用「11号」作战并在恰当的时机点按普通攻击，连续发动11次「火力镇压」。', '1', '1', '1.2'),
('1009002', '1009', '{M#执事的晚安}{F#晚安大小姐}', '在深夜时段，偶遇正在赏月的莱卡恩。', '1', '1', '1.2'),
('2001064', '2001', '大额存单', '在枯萎之都中，在「零号银行」累计获得2000积分。', '1', '2', '1.2'),
('2001065', '2001', '我在空洞里捡到一分钱', '枯萎之都单次探索中，获得的齿轮硬币累计超过30000枚。', '1', '2', '1.2'),
('2001066', '2001', '揠苗助长', '在［以太活性 11］的难度下，通关「枯败花圃·苗床」。', '3', '2', '1.2'),
('2001067', '2001', '除草熟练工', '通关「枯败花圃·苗床」时，所有代理人生命值均高于70%。', '1', '2', '1.2'),
('2003006', '2003', '路边逼停', '在对战「庞培」的两阶段中，都在其使出钩锁时进行「招架支援」令其摔倒。', '1', '2', '1.2'),
('2004032', '2004', '下「雨」不愁', '完成「仙人掌花的邀约」拉力委托，并全部获得S级评价。', '2', '2', '1.2'),
('2004033', '2004', '「黑」吃「黑」', '在「仙人掌花的邀约」中，找到所有隐藏的小卡格车。', '1', '2', '1.2'),
('2004035', '2004', '一次瞌睡都没打！', '完成所有的「调查员培训课」。', '2', '2', '1.2'),
('2004036', '2004', '同仇敌忾', '接取黑曜石营的战斗委托，完成「与空洞为敌Ⅰ」、「与空洞为敌Ⅱ」。', '1', '2', '1.2'),
('2004037', '2004', '老顾客·新生意', '接取芮恩的战斗委托，完成「夜雨的请托：谜影搏杀Ⅰ」、「夜雨的请托：谜影搏杀Ⅱ」。', '1', '2', '1.2'),
('3001023', '3001', '外环最速传说', '在「英雄诞生的骑行」中，150秒内通过空洞内的骑行路段。', '1', '2', '1.2'),
('3001024', '3001', '完美漂移', '在「英雄诞生的骑行」中，未躲避路面障碍的次数小于5次。', '1', '2', '1.2'),
('3001025', '3001', '飞蓬与旷野', '在「远行的序幕」中，为即将出发的阿蓬和小野合影，并把照片交给他们。', '1', '1', '1.2'),
('3001026', '3001', '高效越狱，附赠烟花', '在「岩矿场的救赎」中，连续引爆10个埋藏在矿井中的炸弹。', '1', '2', '1.2')
    AS new
ON DUPLICATE KEY UPDATE
                     class_id = new.class_id,
                     name = new.name,
                     description = new.description,
                     reward_level = new.reward_level,
                     hidden = new.hidden,
                     game_version = new.game_version;