USE HoYo_Achievement;

INSERT INTO zzz_achievement (achievement_id, class_id, name, description, reward_level, hidden, game_version)
VALUES
('1004045', '1004', '与你托付后背', '「扳机」对绳匠的信赖达到4阶。', '1', '2', '1.6'),
('1004046', '1004', '你的名字', '「11号」对绳匠的信赖达到4阶。', '1', '2', '1.6'),
('1004047', '1004', '朋友（试用期）', '波可娜对绳匠的信赖达到4阶。', '1', '2', '1.6'),
('1005009', '1005', '命运于此收场', '完成法厄同纪事「将眼泪与过往一同埋葬 上」。', '3', '1', '1.6'),
('1006012', '1006', '最后一眼与初次见面', '完成「扳机」的代理人秘闻「目不可及」。', '2', '1', '1.6'),
('1006013', '1006', '白银的见证者', '完成「零号·安比」的代理人秘闻「白银的复苏」。', '2', '1', '1.6'),
('1009003', '1009', '见证者·万层之巅', '在HIA俱乐部，听到关于「拟真鏖战试炼」万层通关者的讨论。', '1', '1', '1.6'),
('1009004', '1009', '见证者·勇者之踵', '在HIA俱乐部，听到退役调查员体验「拟真鏖战试炼」的故事。', '1', '1', '1.6'),
('2005009', '2005', '暂无迷失之虞', '在［以太活性 12］的难度下，通关「战线肃清·难度六」。', '3', '2', '1.6'),
('2005010', '2005', '婉拒医疗援助', '单局内，3次进入[休憩调息]，每次都选择获得鸣徽。', '1', '2', '1.6'),
('2005011', '2005', '急需医疗援助！', '单局内，3次进入[休憩调息]，每次都选择回复生命。', '1', '2', '1.6'),
('2005012', '2005', '狂热采购者', '单次进入[邦布商店]后，一次性购买8个藏品。', '1', '2', '1.6'),
('2005013', '2005', '谨慎消费者', '单局内，3次进入[邦布商店]，花费齿轮硬币都少于500枚。', '1', '2', '1.6'),
('2005014', '2005', '挑剔的顾客', '单次进入[邦布商店]后，刷新鸣徽超过6次。', '1', '1', '1.6'),
('2005015', '2005', '轻盈身法', '进入[挑战·无伤]区域，在不受击的情况下通关。', '1', '2', '1.6'),
('2005016', '2005', '快刀斩乱骸', '进入[挑战·限时]区域，在6秒内通关。', '1', '2', '1.6'),
('2005017', '2005', '一网打尽', '进入[挑战·收割]区域，击败所有敌人。', '1', '2', '1.6'),
('2005018', '2005', '精确购物预算', '进入奸商布的[偶遇事件]，接受其交易并当场花光所有齿轮硬币。', '1', '1', '1.6'),
('2005019', '2005', '大空洞的馈赠', '进入「神秘的声音」的[偶遇事件]，获得其提供的额外武备。', '1', '1', '1.6'),
('2005021', '2005', '谁是衰仔？', '光顾衰仔的「『好彩』降临点」，连续3次未能获得好收获。', '1', '1', '1.6'),
('2005022', '2005', '没有衰仔！', '光顾衰仔的「『好彩』降临点」，连续3次抽奖获得好收获。', '1', '1', '1.6'),
('2005023', '2005', '只想要试用装', '进入VIP客服的[偶遇事件]，不消耗齿轮硬币并获得3枚鸣徽。', '1', '1', '1.6'),
('2005024', '2005', '出门靠朋友', '累计5次，进入[战斗]区域时，发现代理人已经清扫战场。', '1', '1', '1.6'),
('2005025', '2005', '空洞金融大亨', '获得卡牌「金钱攻势」，并携带超过8000枚齿轮硬币通关。', '1', '2', '1.6'),
('2005026', '2005', '金融大亨小失误', '获得卡牌「大垄断家」，并触发「仅获得1枚齿轮硬币」的效果。', '1', '1', '1.6')
    AS new
ON DUPLICATE KEY UPDATE
                     class_id = new.class_id,
                     name = new.name,
                     description = new.description,
                     reward_level = new.reward_level,
                     hidden = new.hidden,
                     game_version = new.game_version;