USE HoYo_Achievement;

INSERT INTO zzz_achievement (achievement_id, class_id, name, description, reward_level, hidden, game_version)
VALUES
('1001080', '1001', '被嘉音包围了！', '在丽都各处，寻找并拍摄5张耀嘉音主演的影片、广告和演唱会的海报。', '1', '2', '1.5'),
('1001081', '1001', '关于致富的尝试', '在星环电视塔的VIP包厢中，「试坐」一下昂贵的沙发。', '1', '1', '1.5'),
('1001082', '1001', '另一颗星星', '在星环电视塔，「碰巧」听到一些关于莫妮卡女士的聊天。', '1', '1', '1.5'),
('1001083', '1001', '眺望拂晓的天光', '在星环电视塔，「碰巧」找到一些关于「妄想天使」的消息。', '1', '1', '1.5'),
('1004040', '1004', '聚光灯外的人生', '耀嘉音对绳匠的信赖达到4阶。', '1', '2', '1.5'),
('1004041', '1004', '不设防的线', '伊芙琳对绳匠的信赖达到4阶。', '1', '2', '1.5'),
('1004042', '1004', '与你跌落梦境', '在「密友同行」中，和任意代理人一起玩「怪奇旅伴」。', '1', '1', '1.5'),
('1004043', '1004', '直到梦魇尽头', '在「密友同行」中，和任意代理人一起玩「怪奇旅伴」并存活15波以上。', '1', '1', '1.5'),
('1004044', '1004', '谁点亮了小夜灯', '在「密友同行」中，和安比、莱卡恩、浅羽悠真一起玩「怪奇旅伴」，且存活均超过5波。', '1', '1', '1.5'),
('1006011', '1006', '这只鲨鲨不太冷', '完成艾莲的代理人秘闻「我是艾莲，在忙，有事留言」。', '2', '1', '1.5'),
('1007004', '1007', '乘着歌声的翅膀', '完成耀嘉音的独家视界「闪耀的此刻」。', '3', '1', '1.5'),
('1008009', '1008', '大师赛一号种子', '在「厄匹斯极钓大师赛」中，完成比赛。', '1', '2', '1.5'),
('1008010', '1008', '钓鱼佬闲话集', '在「厄匹斯极钓大师赛」中，完成所有「港口逸事」。', '1', '2', '1.5'),
('1008011', '1008', '绝不！空军！', '在「厄匹斯极钓大师赛」的「垂钓图鉴」中，集齐77颗星星。', '1', '2', '1.5'),
('1008012', '1008', '什么都能钓到，除了…', '在「厄匹斯极钓大师赛」的「垂钓图鉴」中，集齐所有杂物。', '1', '2', '1.5'),
('1008013', '1008', '什么都能钓到，包括鱼！', '在「厄匹斯极钓大师赛」的「垂钓图鉴」中，集齐所有鱼类。', '1', '2', '1.5'),
('1008014', '1008', '瓶中的心愿', '在「厄匹斯极钓大师赛」中，完成委托「奇迹从不迟到」。', '1', '1', '1.5'),
('1008015', '1008', '保持风格！', '在「如愿璀璨之日」中，穿着非关卡主题的装扮赢下「丽都有布」的任意关卡。', '1', '2', '1.5'),
('1008016', '1008', '舞蹈练习生', '在「如愿璀璨之日」中，完成「丽都有布」的所有「加练」关卡并获得S级评分。', '1', '2', '1.5'),
('1008017', '1008', '舞所布能', '在「如愿璀璨之日」中，完成「丽都有布」的所有「精进」关卡并获得S级评分。', '1', '2', '1.5'),
('1008018', '1008', '缪斯的衣橱', '在「如愿璀璨之日」的「伊埃斯梦工场」中，集齐所有演出服装。', '1', '2', '1.5'),
('2004045', '2004', '世间并无穷途', '在「鏖战试炼·末路」中，通关第100层。', '3', '2', '1.5'),
('2004046', '2004', '踏上末路…之前呢？', '在「鏖战试炼·末路」中，发现隐藏层。', '1', '1', '1.5'),
('2004047', '2004', '魔王预备役', '在「鏖战试炼·末路」中，获得1个「『魔王』奖章」。', '2', '2', '1.5'),
('2004048', '2004', '魔王优等生', '在「鏖战试炼·末路」中，累计获得10个「『魔王』奖章」。', '3', '2', '1.5'),
('2004049', '2004', '港口环保大师', '完成厄匹斯港区域的3个拉力委托，并全部获得S级评价。', '2', '2', '1.5'),
('2004050', '2004', '全量回收确认', '在厄匹斯港区域的3个拉力委托中，找到所有隐藏的小卡格车。', '1', '2', '1.5')
    AS new
ON DUPLICATE KEY UPDATE
                     class_id = new.class_id,
                     name = new.name,
                     description = new.description,
                     reward_level = new.reward_level,
                     hidden = new.hidden,
                     game_version = new.game_version;